nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_dac.h
/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief DAC driver version. */
#define FSL_DAC_DRIVER_VERSION (MAKE_VERSION(2, 0, 0))
/*@}*/

/*!
 * @brief The enumeration of DAC status flags, including FIFO full status flag and FIFO empty status flag.
 */
enum _dac_fifo_status_flags
{
    kDAC_FIFOFullStatusFlag  = DAC_STATUS_FULL_MASK,  /*!< Indicate the FIFO is full. */
    kDAC_FIFOEmptyStatusFlag = DAC_STATUS_EMPTY_MASK, /*!< Indicate the FIFO is empty. */
};

/*!
 *@brief The enumeration of DAC operation mode, including normal operation mode and automatic operation mode.
 */
typedef enum _dac_operation_mode
{
    kDAC_NormalOperationMode    = 0U, /*!< Normal Mode to generate an analog representation of digital words. */
    kDAC_AutomaticOperationMode = 1U, /*!< Automatic Mode to generate waveform without
                                            requiring CPU or core assistance. */
} dac_operation_mode_t;

/*!
 * @brief The enumeration of DAC sync signal mode, including internal clock signal and external SYNC_IN signal.
 */
typedef enum _dac_sync_signal_selection
{
    kDAC_InternalClockSignal = 0U,  /*!< Internal Clock signal is selected as SYNC signal, data written to the buffered
                                        registers is used on the next clock cycle */
    kDAC_ExternalSyncInSignal = 1U, /*!< Peripheral external signal is selected as SYNC signal, the update occurs on the
                                        active edge of SYNC_IN signal. */
} dac_sync_signal_selection_t;

/*!
 * @brief The enumeration of waveform type, such as square waveform, triangle waveform, etc.
 */
typedef enum _dac_waveform_type
{
    kDAC_RepeatSawtoothWaveform0 = 0U, /*!< DAC generates repeated sawtooth waveform0. The automatic waveform generation
                                          logic will create a repeated sawtooth waveform0 upon receiving an active SYNC
                                          edge, and the waveform repeats when it reaches its minimum and maximum value.
                                          The waveform increases from starting value to max value firstly.
                                          Like this following shown:
                                          @verbatim
                                                 /|   /|   /|   /|
                                                / |  / |  / |  / |
                                                  | /  | /  | /  |
                                                  |/   |/   |/   |
                                          @endverbatim     */
    kDAC_RepeatSawtoothWaveform1 = 1U, /*!< DAC generates sawtooth waveform1. The automatic waveform generation
                                          logic will create a repeated sawtooth waveform1 upon receiving an active SYNC
                                          edge, and the waveform repeats when it reaches its minimum and maximum value.
                                          The waveform decreases from starting value to min value firstly.
                                          Like this following shown:
                                          @verbatim
                                                       |\   |\   |\   |\
                                                       | \  | \  | \  | \
                                                     \ |  \ |  \ |  \ |  \
                                                      \|   \|   \|   \|   \
                                          @endverbatim    */
    kDAC_RepeatTriangleWaveform0 = 2U, /*!< The automatic waveform generation logic will create a repeated sawtooth
                                          waveform1 upon receiving an active SYNC edge, and the waveform repeats when
                                          it reaches its minimum and maximum value. In this type the generated triangle
                                          waveform rises from the starting value.
                                          Like this following shown:
                                          @verbatim
                                                  /\      /\      /\
                                                 /  \    /  \    /  \    /
                                                /    \  /    \  /    \  /
                                                      \/      \/      \/
                                          @endverbatim   */
    kDAC_RepeatTriangleWaveform1 = 3U, /*!< The automatic waveform generation logic will create a repeated sawtooth
                                          waveform1 upon receiving an active SYNC edge, and the waveform repeats when
                                          it reaches its minimum and maximum value. In this type the generated triangle
                                          waveform drops from the starting value. Like this
                                          following shown:
                                          @verbatim
                                                    /\      /\      /\
                                              \    /  \    /  \    /  \
                                               \  /    \  /    \  /
                                                \/      \/      \/
                                          @endverbatim    */
    kDAC_OneShotSawtoothWaveform0 = 4U, /*!< Automatic waveform generation logic will create a single
                                           pattern and stop at the final value. It will remain at the finial
                                           value until a new active edge occurs on the SYNC input, and then
                                           the waveform will be repeated. Like this following shown:
                                           @verbatim
                                                              /|       /|
                                                             / |      / |
                                                            /  |     /  |
                                                       ____/   |____/   |___
                                           @endverbatim */
    kDAC_OneShotSawtoothWaveform1 = 5U, /*!< Automatic waveform generation logic will create a single
                                           pattern and stop at the final value. It will remain at the finial
                                           value until a new active edge occurs on the SYNC input, and then
                                           the waveform will be repeated. Like this following shown:
                                           @verbatim:
                                                    |\      |\
                                                    | \     | \
                                                    |  \    |  \
                                                ____|   \___|   \__
                                           @endverbatim */
} dac_waveform_type_t;

/*!
 * @brief The enumeration of sync input edge that used for updates buffered registers, such as Falling edge, etc.
 */
typedef enum _dac_sync_input_edge
{
    kDAC_NoActiveEdge = 0U, /*!< No active edge is selected, it means the SYNC input is ignored. */
    kDAC_FallingEdge  = 1U, /*!< Updates occur on the falling edge of the SYNC input. */
    kDAC_RisingEdge   = 2U, /*!< Updates occur on the rising edge of the SYNC input. */
    kDAC_BothEdges    = 3U, /*!< Updates occur on both edges of the SYNC input. */
} dac_sync_input_edge_t;

/*!
 * @brief The enumeration of DAC speed mode, including high speed mode and low speed mode.
 */
typedef enum _dac_speed_mode
{
    kDAC_HighSpeedMode = 0U, /*!< In High Speed Mode, the setting time of the DAC module is 1us,
                                    but the DAC module uses more power. */
    kDAC_LowSpeedMode = 1U,  /*!< In Low Speed Mode, the DAC module uses less power but takes more time to settle. */
} dac_speed_mode_t;

/*!
 * @brief The enumeration of FIFO watermark level.
 */
typedef enum _dac_watermark_level
{
    kDAC_WatermarkValue0 = 0U, /*!< Watermark value is 0.*/
    kDAC_WatermarkValue2 = 1U, /*!< Watermark value is 2. */
    kDAC_WatermarkValue4 = 2U, /*!< Watermark value is 4. */
    kDAC_WatermarkValue6 = 3U, /*!< Watermark value is 6 */
} dac_watermark_level_t;

/*!
 * @brief The enumeration of DAC data format, inclding right right-justified and left-justified.
 */
typedef enum _dac_data_format
{
    kDAC_DataWordRightJustified = 0U, /*!< The 12 bits data is right-justified. */
    kDAC_DataWordLeftJustified  = 1U, /*!< The 12 bits data iss left-justified. */
} dac_data_format_t;

/*!
 * @brief The structure of configuration when the operation mode is selected are normal operation mode.
 */
typedef struct _dac_normal_mode_config
{
    bool bEnableDMA;                       /*!< Enable/Disable DMA support.
                                               - \b true Enable DMA support.
                                               - \b false Disable DMA support. */
    dac_watermark_level_t eWatermarkLevel; /*! The FIFO watermark level, if the level of FIFO is less than or
                                               equal to the watermark level field, a DMA request should be sent. */
    uint16_t u16DataFIFO;                  /*!< The DAC data to be converted to analog. If the data format is set as
                                                @ref kDAC_DataWordRightJustified then u16DataFIFO should range from 0 to
                                                4095, which means the higher 4 bits is useless. If the data format is
                                                set as @ref kDAC_DataWordLeftJustified, then the u16DataFIFO should
                                                range from 16 to 65520, which means the lower 4 bits is useless. */
} dac_normal_mode_config_t;

/*!
 * @brief The structure of configuration when the operation mode is selected as automatic operation mode.
 */
typedef struct _dac_automatic_mode_config
{
    dac_waveform_type_t eWaveformType; /*!< The type of waveform to be generated. */
    uint16_t u16StepSize;              /*! The step size to be added to or subtracted from the current value.
                                            If the data format is set as @ref kDAC_DataWordRightJustified then
                                            u16StepSize should range from 0 to 4095, which means the higher 4 bits is
                                            useless. If the data format is set as @ref kDAC_DataWordLeftJustified, then
                                            the u16StepSize should range from 16 to 65520, which means the lower 4 bits
                                            is useless.  */
    uint16_t u16MinValue;              /*!< The minimum value is the lower range limit during automatic waveform
                                            generation. If the data format is set as @ref kDAC_DataWordRightJustified
                                            then u16MinValue should range from 0 to 4095, which means the higher 4 bits
                                            is useless. If the data format is set as @ref kDAC_DataWordLeftJustified,
                                            then the u16MinValue should range from 16 to 65520, which means the lower 4
                                            bits is useless. */
    uint16_t u16MaxValue;              /*!< The maximum value is the upper range limit during automatic waveform
                                            generation. If the data format is set as @ref kDAC_DataWordRightJustified
                                            then u16MaxValue should range from 0 to 4095, which means the higher 4 bits
                                            is useless. If the data format is set as @ref kDAC_DataWordLeftJustified,
                                            then the u16MaxValue should range from 16 to 65520, which means the lower 4
                                            bits is useless. */
    uint16_t u16StartValue;            /*!< The start value of the wavefrom, should larger than the minium value and
                                        smaller than the maximum value. */
    uint16_t u16CompareValue;          /*!< The compare value that used to decide the frequency of REFRESH signal.
                                            The available range is 0 ~ 65535.
                                            - \b u16CompareValue=0 The REFRESH signal's frequency is equal to the clock's
                                                frequency so that the generated waveform will be updated every clock cycle.
                                            - \b u16CompareValue=N(N!=0) The REFRESH signal's frequency is equal to
                                                clock's frequency divided N+1 so that the generated waveform will be
                                                updated every N+1 clock cycles */
} dac_automatic_mode_config_t;

/*!
 * @brief The union of operation modes' configuration.
 */
typedef union _dac_operation_config
{
    dac_normal_mode_config_t sNormalModeConfig;       /*!< The configuration of normal operation mode， such as
                                                            buffered data, watermark level, etc. */
    dac_automatic_mode_config_t sAutomaticModeConfig; /*!< The configuration of automatic operation mode, such as step
                                                            size, minimum value, maximum value, etc. */
} dac_operation_config_u;

/*!
 * @brief The structure for configuring the DAC.
 *
 * This structure is used to config the DAC module, to initialize the DAC module, user must
 * set the member of this structure. This structure will cost 20 Byte memory space.
 */
typedef struct _dac_config
{
    dac_operation_mode_t eOperationMode;     /*!< The operation mode. The available selections are @enum
                                             kDAC_NormalOperationMode and @enum kDAC_AutomaticOperationMode. */
    dac_sync_signal_selection_t eSyncSignal; /*!< The selected sync signal that used to update buffered data, the
                                                   available selections are @enum kDAC_InternalClockSignal and
                                                   @enum kDAC_ExternalSyncInSignal */
    dac_sync_input_edge_t eSyncInputEdge;    /*!< The SYNC input edge used to update buffered registers. The
                                                 buffered value will be updated at the selected active edge of
                                                 SYNC_IN signal. */
    dac_data_format_t eDataFormat;           /*!< The data format of DAC instance. The available selections are
                                                 @enum kDAC_DataWordRightJustified and @enum kDAC_DataWordLeftJustified */
    dac_operation_config_u uOperationConfig; /*!< The configuration of operation mode. */
    bool bEnableGlitchFilter;                /*!< Enable/Disable glitch suppression filter.
                                                 - \b true Enable glitch filter.
                                                 - \b false Disable glitch filter. */
    uint8_t u8GlitchFilterCount;             /*!< The count(ranges from 0 to 63) represents the number of clock
                                                 cycles for which the DAC output is held unchanged after new data
                                                 is presented to the analog DAC's inputs. */

    dac_speed_mode_t eSpeedMode; /*!< The speed mode of DAC instance. The available selections are
                                     @enum kDAC_HighSpeedMode and @enum kDAC_LowSpeedMode. */
    bool bEnableAnalogPortion;   /*!< Power up/down the analog portion.
                                     - \b true Power up the analog portion of the DAC, and the DAC will
                                         output the value currently presented to its inputs.
                                     - \b false Power down the analog portion of the DAC, and its
                                         output will be pulled down. */
} dac_config_t;

