nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_dac.h
/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name Initialization And De-initialization Interfaces
 * @{
 */

/*!
 * @brief Initializes the DAC resource, including data format, sync signal, operation mode, etc.
 *
 * @param base DAC peripheral base address.
 * @param psConfig The pointer to @ref dac_config_t.
 */
void DAC_Init(DAC_Type *base, const dac_config_t *psConfig);

/*!
 * @brief  De-initializes the DAC resource, the clock and power will be gated off.
 *
 * Invoking this function to power down the analog portion of DAC and disable the DAC clock.
 *
 * @param base DAC peripheral base address.
 */
void DAC_Deinit(DAC_Type *base);

/*!
 * @brief Gets the default DAC configs, such as operation mode, watermark level, sync signal, etc.
 *
 * @code
        psConfig->eOperationMode = kDAC_NormalOperationMode;
        psConfig->uOperationConfig.sNormalModeConfig.u16DataFIFO = 0U;
        psConfig->bEnableDMA                                       = false;
        psConfig->eWatermarkLevel = kDAC_WatermarkValue2;
        psConfig->eSyncInputEdge                                   = kDAC_RisingEdge;
        psConfig->eSpeedMode                                       = kDAC_HighSpeedMode;
        psConfig->eDataFormat                                      = kDAC_DataWordRightJustified;
        psConfig->eSyncSignal                                        = kDAC_InternalClockSignal;
        psConfig->bEnableAnalogPortion                          = false;
        psConfig->bEnableGlitchFilter                              = true;
        psConfig->u8GlitchFilterCount                              = 29U;
    @endcode
 *
 * @param psConfig The pointer to @ref dac_config_t.
 */
void DAC_GetDefaultConfig(dac_config_t *psConfig);

/*!
 * @name Conversion Modes Related Interfaces
 * @{
 */

/*!
 * @brief Selects which SYNC input edge is used for updates, available selections are "no active edge", "falling edge",
 * "rising edge", "both edge".
 *
 * @param base DAC peripheral base address.
 * @param eSyncEdge The input edge to be set, please refer to @ref dac_sync_input_edge_t for details.
 */
static void DAC_SetSyncEdge(DAC_Type *base, dac_sync_input_edge_t eSyncEdge)
{
    uint16_t tmp16;

    tmp16 = base->CTRL0;
    tmp16 &= ~DAC_CTRL0_SYNCEDGE_MASK;
    tmp16 |= DAC_CTRL0_SYNCEDGE(eSyncEdge);

    base->CTRL0 = tmp16;
}

/*!
 * @brief Updates the buffered value of stepSize, minValue ,and maxValue at the active edge of the SYNC_IN signal.
 *
 * @note Allows new values of minimum, maximum, and step value to be updated by active edge of SYNC_IN. This function
 * should be invoked once new values of these buffered registers have been written by software. The LDOK bit will be
 * cleared by an active edge of SYNC_IN.
 * @note This function is only useful when the operation mode is selected as Automatic operation mode.
 *
 * @param base DAC peripheral base address.
 */
static inline void DAC_SetLDOK(DAC_Type *base)
{
    base->CTRL0 |= DAC_CTRL0_LDOK_MASK;
}

/*!
 * @brief Gets the value of load Okay bit field.
 *
 * @note When the SYNC signal is selected as external SYNC_IN signal, the load okay bit will be cleared by an active
 * edge of the SYNC_IN signal. This function can be used to check whether the active edge of the SYNC_IN signal has
 * reached.
 * @note This function is only useful when the operation mode is selected as Automatic operation mode.
 *
 * @param base DAC peripheral base address.
 * @return
 *      - \b true The active edge of SYNC_IN signal has not reached when the SYNC signal is selected as external
 *                SYNC_IN signal.
 *      - \b false The active edge of SYNC_IN signal has reached when the SYNC signal is selected as external
 *                SYNC_IN signal
 */
static inline bool DAC_GetLDOKValue(DAC_Type *base)
{
    return ((base->CTRL0 & DAC_CTRL0_LDOK_MASK) == DAC_CTRL0_LDOK_MASK);
}

/*! @} */

/*!
 * @name Operation Modes Related Interfaces
 * @{
 */

/*!
 * @brief Enables/Disables Oneshot feature, oneshot feature used to determines whether automatic waveform generation
 * creates one waveform or a repeated waveform within the period defined by the active SYNC edges.
 *
 * @note This function only useful when the operation mode is selected as automatic operation mode.
 *
 * @param base DAC peripheral base address.
 * @param bEnable Enable/Disable oneshot feature.
 *              - \b true Automatic waveform generation logic will create a single pattern and stop at the final value.
 *              - \b false Automatic waveform generation logic will create a repeated (continuous) waveform upon
 *                          receiving an active SYNC edge.
 */
static inline void DAC_EnableOneShot(DAC_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->CTRL0 |= DAC_CTRL0_ONESHOT_MASK;
    }
    else
    {
        base->CTRL0 &= ~DAC_CTRL0_ONESHOT_MASK;
    }
}

/*!
 * @brief Writes DAC buffered data value based on the data format when the DAC is in normal
 * operation mode.
 *
 * @param base DAC peripheral base address.
 * @param u16Data The DAC data to be converted to analog. If the data format is set as @ref kDAC_DataWordRightJustified
 *                then u16Data should range from 0 to 4095, which means the higher 4 bits is useless. If the data format
 *                is set as @ref kDAC_DataWordLeftJustified, then the u16Data should range from 16 to 65520, which means
 *                the lower 4 bits is useless.
 */
static inline void DAC_WriteDataFIFO(DAC_Type *base, uint16_t u16Data)
{
    base->FMT0.DATAREG_FMT0 = u16Data;
}

/*!
 * @brief Writes Step size based on the data format when the DAC is in automatic operation mode.
 *
 * @note This function only useful when the operation mode is selected as automatic operation mode.
 *
 * @param base DAC peripheral base address.
 * @param u16StepSize The step value to be added to or subtracted from the current value. If the data format is set as
 *                    @ref kDAC_DataWordRightJustified then u16StepSize should range from 0 to 4095, which means the
 *                    higher 4 bits is useless. If the data format is set as @ref kDAC_DataWordLeftJustified, then the
 *                    u16StepSize should range from 16 to 65520, which means the lower 4 bits is useless.
 */
static inline void DAC_WriteStepSize(DAC_Type *base, uint16_t u16StepSize)
{
    base->FMT0.STEPVAL_FMT0 = u16StepSize;
}

/*!
 * @brief Writes the minium value based on the data format when the DAC is in automatic
 * operation mode.
 *
 * @note This function only useful when the operation mode is selected as automatic operation mode. If DAC input data is
 * less than the minium value, output is limited to the minium value during automatic waveform generation.
 *
 * @param base DAC peripheral base address.
 * @param u16MinValue The lower range limit during automatic waveform generation. If the data format is set as
 *                    @ref kDAC_DataWordRightJustified then u16MinValue should range from 0 to 4095, which means the
 *                    higher 4 bits is useless. If the data format is set as @ref kDAC_DataWordLeftJustified, then the
 *                    u16MinValue should range from 16 to 65520, which means the lower 4 bits is useless.
 */
static inline void DAC_WriteMinValue(DAC_Type *base, uint16_t u16MinValue)
{
    base->FMT0.MINVAL_FMT0 = u16MinValue;
}

/*!
 * @brief Writes the maximum value based on the data format when the DAC is in automatic
 * operation mode.
 *
 * @note This function only useful when the operation mode is selected as automatic operation mode. If DAC input data is
 * greater than maximum value, output is limited to maximum value during automatic waveform generation.
 *
 * @param base DAC peripheral base address.
 * @param u16MaxValue The upper range limit during automatic waveform generation. If the data format is set as
 *                    @ref kDAC_DataWordRightJustified then u16MaxValue should range from 0 to 4095, which means the
 *                    higher 4 bits is useless. If the data format is set as @ref kDAC_DataWordLeftJustified, then the
 *                    u16MaxValue should range from 16 to 65520, which means the lower 4 bits is useless.
 */
static inline void DAC_WriteMaxValue(DAC_Type *base, uint16_t u16MaxValue)
{
    base->FMT0.MAXVAL_FMT0 = u16MaxValue;
}

/*!
 * @brief Sets refresh frequency that used to decide when the automatically generated waveform value is updated.
 *
 * @note This function only useful when the operation mode is selected as automatic operation mode.
 *
 * @param base DAC peripheral base address.
 * @param u16CompareValue The compare value(0~65535).
 *                        - \b u16CompareValue=0 The generated waveform will be updated every clock cycle.
 *                        - \b u16CompareValue=N(N!=0) The generated waveform will be updated every N+1 clock cycles.
 */
static inline void DAC_ConfigRefreshFrequency(DAC_Type *base, uint16_t u16CompareValue)
{
    base->COMPARE = DAC_COMPARE_COMPARE(u16CompareValue);
}

/*! @} */

/*!
 * @name DMA Control Related Interfaces
 * @{
 */

/*!
 * @brief Enables/Disables DMA request that to be generated when the FIFO is below the watermark level.
 *
 * @note This function is only useful when the operation mode is selected as Normal mode.
 *
 * @param base DAC peripheral base address.
 * @param bEnable Enable/Disable DMA support.
 *              - \b true Enable DMA support.
 *              - \b false Disable DMA support.
 */
static inline void DAC_EnableDMA(DAC_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->CTRL0 |= DAC_CTRL0_DMA_EN_MASK;
    }
    else
    {
        base->CTRL0 &= ~DAC_CTRL0_DMA_EN_MASK;
    }
}

/*!
 * @brief Sets watermark level which is used for asserting a DMA request.
 *
 * @note When the level of FIFO is less than or equal to the Watermark level, a DMA
 *      request will be sent. This function is only  useful when the operation mode is selected as Normal mode.
 *
 * @param base DAC peripheral base address.
 * @param eWatermarkLevel The watermark level of FIFO, please refer to @ref dac_watermark_level_t for details.
 */
static void DAC_SetWatermarkLevel(DAC_Type *base, dac_watermark_level_t eWatermarkLevel)
{
    uint16_t tmp16;

