nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_dac.h
    tmp16 = base->CTRL0;
    tmp16 &= ~DAC_CTRL0_WTMK_LVL_MASK;
    tmp16 |= DAC_CTRL0_WTMK_LVL(eWatermarkLevel);

    base->CTRL0 = tmp16;
}

/*! @} */

/*!
 * @name Glitch Filter Related Interfaces
 * @{
 */

/*!
 * @brief Enables/Disables Glitch filter.
 *
 * @param base DAC peripheral base address.
 * @param bEnable Enable/Disable Glitch filter.
 *          - \b true Enable glitch filter.
 *          - \b false Disable glitch filter.
 */
static inline void DAC_EnableGlitchFilter(DAC_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->CTRL0 |= DAC_CTRL0_FILT_EN_MASK;
    }
    else
    {
        base->CTRL0 &= ~DAC_CTRL0_FILT_EN_MASK;
    }
}

/*!
 * @brief Sets glitch filter count value(ranges from 0 to 63) that represents the number of clock cycles for which the
 * DAC output is held unchanged after new data is presented to the analog DAC's inputs.
 *
 * @param base DAC peripheral base address.
 * @param u8FilterCount The count of glitch filter. This count represents the number of clock cycles for which the DAC
 *                      output is held unchanged after new data is presented to the analog DAC's inputs.
 */
static inline void DAC_SetGlitchFilterCount(DAC_Type *base, uint8_t u8FilterCount)
{
    base->CTRL1 = DAC_CTRL1_FILT_CNT(u8FilterCount);
}

/*! @} */

/*!
 * @name Power And Speed Related Interface
 * @{
 */

/*!
 * @brief Selects speed mode, high speed mode uses more power and low speed mode saves power.
 *
 * @param base DAC peripheral base address.
 * @param eSpeedMode The speedMode to be set, please refer to @ref dac_speed_mode_t for details.
 */
static inline void DAC_SetSpeedMode(DAC_Type *base, dac_speed_mode_t eSpeedMode)
{
    if (eSpeedMode == kDAC_HighSpeedMode)
    {
        base->CTRL0 &= ~DAC_CTRL0_HSLS_MASK;
    }
    else
    {
        base->CTRL0 |= DAC_CTRL0_HSLS_MASK;
    }
}

/*!
 * @brief Enables/Disables the operation of the analog portion of the DAC.
 *
 * The function controls the power-up of the analog portion of the DAC. If powered up the analog portion, the DAC module
 * will output the value currently presented to the Data register. The analog portion should be powered up when the DAC
 * is in use. If power down the analog portion, the output of the DAC module will be pulled low. The analog portion
 * should be powered down when the DAC is not in use.
 *
 * @param base DAC peripheral base address.
 * @param bEnable Power up/down the analog portion of the DAC.
 *          - \b true Power up the analog portion of the DAC, and the DAC will output the value currently presented to
 *                    its inputs.
 *          - \b false Power down the analog portion of the DAC, and its output will be pulled down.
 */
static inline void DAC_EnableAnalogPortion(DAC_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->CTRL0 &= ~DAC_CTRL0_PDN_MASK;
    }
    else
    {
        base->CTRL0 |= DAC_CTRL0_PDN_MASK;
    }
}

/*! @} */

/*!
 * @name Status Flags Interface
 * @{
 */

/*!
 * @brief Gets the fifo status flag of selected DAC instance.
 *
 * @param base DAC peripheral base address.
 * @return The status flags of DAC module, should be the OR'ed value of @ref _dac_fifo_status_flags.
 */
static inline uint16_t DAC_GetFIFOStatusFlags(DAC_Type *base)
{
    return base->STATUS;
}

/*! @} */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */

#endif /* _FSL_DAC_H_ */
